In [ ]:
import numpy as np
import pandas as pd

In [ ]:
data=[1,2,3]
label=['a','b','c']

In [ ]:
l=pd.Series(data,label)

In [ ]:
l

a    1
b    2
c    3
dtype: int64

In [ ]:
l['a']

1

In [ ]:
columns=['A','B','C','D']
rows=['X','Y','Z','W','R']

In [ ]:
from numpy.random import randint
np.random.seed(42)
data=randint(-100,100,(5,4))  
data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

In [ ]:
l=pd.DataFrame(data,rows,columns)
l

    A   B   C   D
X   2  79  -8 -86
Y   6 -29  88 -80
Z   2  21 -26 -13
W  16  -1   3  51
R  30  49 -48 -99

In [ ]:
l['A']

X     2
Y     6
Z     2
W    16
R    30
Name: A, dtype: int64

In [ ]:
l[['A','B']]

    A   B
X   2  79
Y   6 -29
Z   2  21
W  16  -1
R  30  49

In [ ]:
l.loc['X']

A     2
B    79
C    -8
D   -86
Name: X, dtype: int64

In [ ]:
l['new']=l['A']+l['B']

In [ ]:
l

    A   B   C   D  new
X   2  79  -8 -86   81
Y   6 -29  88 -80  -23
Z   2  21 -26 -13   23
W  16  -1   3  51   15
R  30  49 -48 -99   79

In [ ]:
l=l.drop('new',axis=1)
l

    A   B   C   D
X   2  79  -8 -86
Y   6 -29  88 -80
Z   2  21 -26 -13
W  16  -1   3  51
R  30  49 -48 -99

In [ ]:
l.drop('R')

    A   B   C   D
X   2  79  -8 -86
Y   6 -29  88 -80
Z   2  21 -26 -13
W  16  -1   3  51

In [ ]:
l.loc['new']=l.loc['X']+l.loc['Y']

In [ ]:
l

      A   B   C    D
X     2  79  -8  -86
Y     6 -29  88  -80
Z     2  21 -26  -13
W    16  -1   3   51
R    30  49 -48  -99
new   8  50  80 -166

In [ ]:
l.loc['X','A']

2

In [ ]:
l>0

        A      B      C      D
X    True   True  False  False
Y    True  False   True  False
Z    True   True  False  False
W    True  False   True   True
R    True   True  False  False
new  True   True   True  False

In [ ]:
l[l>0]

      A     B     C     D
X     2  79.0   NaN   NaN
Y     6   NaN  88.0   NaN
Z     2  21.0   NaN   NaN
W    16   NaN   3.0  51.0
R    30  49.0   NaN   NaN
new   8  50.0  80.0   NaN

In [ ]:
l[(l['A']>0) & (l['C']>0)]

      A   B   C    D
Y     6 -29  88  -80
W    16  -1   3   51
new   8  50  80 -166

In [ ]:
l.reset_index()

  index   A   B   C    D
0     X   2  79  -8  -86
1     Y   6 -29  88  -80
2     Z   2  21 -26  -13
3     W  16  -1   3   51
4     R  30  49 -48  -99
5   new   8  50  80 -166

In [ ]:
cities=['NY','OL','MN','BT','BE','VR']

In [ ]:
l['Cities']=cities

In [ ]:
l

      A   B   C    D Cities
X     2  79  -8  -86     NY
Y     6 -29  88  -80     OL
Z     2  21 -26  -13     MN
W    16  -1   3   51     BT
R    30  49 -48  -99     BE
new   8  50  80 -166     VR

In [ ]:
l.set_index('Cities')

         A   B   C    D
Cities
NY       2  79  -8  -86
OL       6 -29  88  -80
MN       2  21 -26  -13
BT      16  -1   3   51
BE      30  49 -48  -99
VR       8  50  80 -166

In [ ]:
l.describe()

               A          B          C           D
count   6.000000   6.000000   6.000000    6.000000
mean   10.666667  28.166667  14.833333  -65.500000
std    10.782702  39.153118  56.350392   75.075296
min     2.000000 -29.000000 -48.000000 -166.000000
25%     3.000000   4.500000 -21.500000  -95.750000
50%     7.000000  35.000000  -2.500000  -83.000000
75%    14.000000  49.750000  60.750000  -29.750000
max    30.000000  79.000000  88.000000   51.000000

In [ ]:
df=pd.DataFrame({'A':[1,2,np.nan,4],'B':[5,np.nan,np.nan,8],'C':[10,20,30,40]})
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [ ]:
df.dropna()

     A    B   C
0  1.0  5.0  10
3  4.0  8.0  40

In [ ]:
df.dropna(axis=1)

    C
0  10
1  20
2  30
3  40

In [ ]:
df.dropna(axis=1,thresh=3)

     A   C
0  1.0  10
1  2.0  20
2  NaN  30
3  4.0  40

In [ ]:
df.fillna(value=0)

     A    B   C
0  1.0  5.0  10
1  2.0  0.0  20
2  0.0  0.0  30
3  4.0  8.0  40

In [ ]:
df['B'].fillna(value=df['B'].mean())

0    5.0
1    6.5
2    6.5
3    8.0
Name: B, dtype: float64

In [ ]:
import pandas as pd
def_one=pd.DataFrame({'k1':['A','A','B','B','C','C'],'col1':[100,200,300,300,400,500],'col2':['NY','CA','WA','WA','AK','NV']})
def_one

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [ ]:
def_one.drop_duplicates()

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
4  C   400   AK
5  C   500   NV

In [ ]:
def_one['col2'].unique()

array(['NY', 'CA', 'WA', 'AK', 'NV'], dtype=object)

In [ ]:
def_one['col2'].nunique()

5

In [ ]:
def_one

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [ ]:
def first_letter(state):
  return state[0]

In [ ]:
def_one['first']=def_one['col2'].apply(first_letter)
def_one

  k1  col1 col2 first
0  A   100   NY     N
1  A   200   CA     C
2  B   300   WA     W
3  B   300   WA     W
4  C   400   AK     A
5  C   500   NV     N

In [ ]:
map_1={'A':1,'B':2,'C':3}

In [ ]:
def_one['mapped_value']=def_one['k1'].map(map_1)
def_one

  k1  col1 col2 first  mapped_value
0  A   100   NY     N             1
1  A   200   CA     C             1
2  B   300   WA     W             2
3  B   300   WA     W             2
4  C   400   AK     A             3
5  C   500   NV     N             3

In [ ]:
def_one.sort_values('col2',ascending=False)

  k1  col1 col2 first  mapped_value
2  B   300   WA     W             2
3  B   300   WA     W             2
0  A   100   NY     N             1
5  C   500   NV     N             3
1  A   200   CA     C             1
4  C   400   AK     A             3

In [ ]:
features=pd.DataFrame({'A':[100,200,300,400,500],'B':[12,13,14,15,16]})
predicted=pd.DataFrame({'Predicted':[0,1,1,0,1]})
features

     A   B
0  100  12
1  200  13
2  300  14
3  400  15
4  500  16

In [ ]:
predicted

   Predicted
0          0
1          1
2          1
3          0
4          1

In [ ]:
pd.concat([features,predicted],axis=1)

     A   B  Predicted
0  100  12          0
1  200  13          1
2  300  14          1
3  400  15          0
4  500  16          1

In [ ]:
pd.get_dummies(def_one['k1'])

   A  B  C
0  1  0  0
1  1  0  0
2  0  1  0
3  0  1  0
4  0  0  1
5  0  0  1

In [ ]:
def_one

  k1  col1 col2 first  mapped_value
0  A   100   NY     N             1
1  A   200   CA     C             1
2  B   300   WA     W             2
3  B   300   WA     W             2
4  C   400   AK     A             3
5  C   500   NV     N             3

In [ ]:
def_one.to_csv('output.csv')

In [ ]:
f=pd.read_csv('output.csv',index_col=0)

In [ ]:
f

  k1  col1 col2 first  mapped_value
0  A   100   NY     N             1
1  A   200   CA     C             1
2  B   300   WA     W             2
3  B   300   WA     W             2
4  C   400   AK     A             3
5  C   500   NV     N             3